tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae" # for skhd
tap "homebrew/cask-fonts" # to install fonts

  tap "clintmod/formulas" # for macprefs, dont use
  tap "osx-cross/avr" # Arduino stuffs, dont use

brew "xz" # compression
brew "avrdude" # arduino stuff
brew "openssl@3"
brew "bat"
brew "bear"
brew "gcc"
brew "cmake"
brew "fd" # super finder
brew "libarchive"
brew "ffmpeg"
brew "fzf"
brew "readline"
brew "htop"
  brew "imagemagick" # image manipulation, dont need
brew "lsusb"
brew "lua"
brew "make"
  brew "navi" # cmd line cheet sheet, dont need
brew "neovim"
brew "node"
brew "sqlite"
brew "opencv"
brew "pyenv"
  brew "tcl-tk"
  brew "python-tk@3.11"
  brew "rustup-init"
  brew "showkey"
brew "switchaudio-osx" # change audio source with cmd
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "wget"
brew "yarn"
  brew "zlib"
brew "koekeishiya/formulae/skhd"
  brew "osx-cross/avr/avr-gcc@9"
cask "blackhole-16ch"
cask "blackhole-2ch"
cask "moom"

# nerd fonts
cask "font-0xproto-nerd-font"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-commit-mono-nerd-font"
cask "font-cousine-nerd-font"
cask "font-d2coding-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-envy-code-r-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-intone-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-iosevka-term-slab-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-lilex-nerd-font"
cask "font-martian-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace-nerd-font"
cask "font-monocraft-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-mplus-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"

  cask "transmission"

  vscode "aaron-bond.better-comments"
  vscode "eamodio.gitlens"
  vscode "formulahendry.auto-rename-tag"
  vscode "GitHub.copilot"
  vscode "GitHub.copilot-chat"
  vscode "jeff-hykin.better-cpp-syntax"
  vscode "mark-wiemer.vscode-autohotkey-plus-plus"
  vscode "ms-python.isort"
  vscode "ms-python.python"
  vscode "ms-python.vscode-pylance"
  vscode "ms-toolsai.jupyter"
  vscode "ms-toolsai.jupyter-keymap"
  vscode "ms-toolsai.jupyter-renderers"
  vscode "ms-toolsai.vscode-jupyter-cell-tags"
  vscode "ms-toolsai.vscode-jupyter-slideshow"
  vscode "ms-vscode.cpptools"
  vscode "stevencl.addDocComments"
  vscode "XadillaX.viml"
